[
  {
    "name": "25% OFF! Fontignac 7-Piece Spaghetti Set",
    "description": "This pasta silverware set adds to the enjoyment of savoring fresh pasta entrees. This set complements contemporary and traditional tablescapes and delivers exceptional quality, performance and durability. \\n\\n 18/10 stainless steel \\nNicely polished surfaces and edges \\nModern contemporary design \\nComplete range of table flatware \\nDurable material, easy to clean \\nShiny finish and corrosion resistant \\nFits to every table setting and occasion \\n\\nAVAILABLE ONLINE ONLY \\n\\nOur Customer Care specialists cannot place orders for this item or any item in the catalogue.",
    "image": "https://www.airmiles.ca/arrow/webresource//Images/details_234x234/1331661335_NEW_DOTW_EN.jpg",
    "price": 600,
    "provider_id": 4,
    "url": "https://www.airmiles.ca/arrow/RewardsProductDetails?productId=prod2656160&cm_sp=Rewards+Product-_-Thumbnails-Products-_-prod2656160"
  },
  {
    "name": "35% OFF! Ferrino of Italy Aerial 3 with Duraluminium Framework 3-Person All Seasons Tent",
    "description": "Ferrino of Italy has been a world leader in outdoor gear for more than 100 years. When it comes to materials, comfort and practical use, Ferrino is on the cutting edge of technology and innovation. Designed with two doors and vestibules, the Ferrino Aerial 3 tent offers easy access and outstanding protection in cold temperatures, heavy rainstorms and snowy backcountry trips.",
    "image": "https://www.airmiles.ca/arrow/webresource//Images/details_234x234/1331661015_NEW_DOTW_EN.jpg",
    "price": 4875,
    "provider_id": 4,
    "url": "https://www.airmiles.ca/arrow/RewardsProductDetails?productId=prod2655550"
  },
  {
    "name": "Broadway Across Canada - Motown the Musical - Package for Two - Edmonton - February 14, 2018",
    "description": "It began as one man's story… became everyone's music… and is now Broadway's musical. Motown the Musical is the true American dream story of Motown founder Berry Gordy’s journey from featherweight boxer to the heavyweight music mogul who launched the careers of Diana Ross, Michael Jackson, Smokey Robinson and many more. \\n \\nMotown shattered barriers, shaped our lives and made us all move to the same beat. Featuring classic songs such as “My Girl” and “Ain’t No Mountain High Enough,” experience the story behind the music in the record-breaking smash hit Motown the Musical! \\n \\nOnly 25 packages are available per city!",
    "image": "https://www.airmiles.ca/arrow/webresource//images/motown-2018-main-e.jpg",
    "price": 2000,
    "provider_id": 4,
    "url": "https://www.airmiles.ca/arrow/ProductTicketingDetails?productId=prod2676530&offerId=1327841132"
  },
  {
    "name": "Hockey Night in Canada 60'' Air Hockey Table",
    "description": "Be the envy of your hockey buddies with the Hockey Night in Canada 60” Air Hockey Table! A necessity for every games room, this table is built for quick and easy assembly, and boasts premium features such as independent leg levelers and a high-powered blower motor for smooth play. The high-gloss, poly-sealed playing surface offers maximum puck glide to make every game a competitive one. Branded with the most recognizable logo in Canadian sports, the Hockey Night in Canada Air Hockey Table will let you show your Canadian pride while enjoying hours of intense hockey action.",
    "image": "https://www.airmiles.ca/arrow/webresource//Images/details_234x234/1331050635_PRE-WEL-35503_1.jpg",
    "price": 3300,
    "provider_id": 4,
    "url": "https://www.airmiles.ca/arrow/RewardsProductDetails?productId=prod2234777"
  },
  {
    "name": "Bigfoot Adventure Series 27-34 Snowshoe Bundle",
    "description": "Ready for a little winter fun? This perfect 'get outside' package includes two pairs of snowshoes, two sets of poles and two carrying bags. Snowshoes feature dual-ratchet PVC freeze-resistant bindings that accommodate all sizes and styles of footwear and a lightweight aircraft-grade aluminium alloy frame. The 3pc telescoping poles have anodized lightweight aircraft-grade aluminium shafts and telescope from 26 inch to 53 inch, making them ideal for any person from 4 foot 6 inch to 6 foot 6 inch tall. Snowshoe and Pole Colour: Blue",
    "image": "https://www.airmiles.ca/arrow/webresource//Images/details_234x234/1330920947_ADVENTURE_27-34_BUNDLE_0713_325.jpg",
    "price": 3950,
    "provider_id": 4,
    "url": "https://www.airmiles.ca/arrow/RewardsProductDetails?productId=prod1924829"
  },
  {
    "name": "Body Break Indoor Upright Spin Cycle Trainer",
    "description": "Spin your way to a healthier, stronger body with this Body Break Indoor Upright Spin Cycle Trainer.\\n \\nFeaturing an 'easy adjust' seat and handlebars, 40lb heavy-duty flywheel and pedals with cycling toe cage and safety straps, this workout wonder will stand up to even the heaviest training demands. Contoured, deluxe, two-tone racing-style seat features adjustable forward/backward and up/down setting for maximum comfort. Track your time, speed, distance and calories on a single window LCD. Maximum user weight: 285lb",
    "image": "https://www.airmiles.ca/arrow/webresource//Images/details_234x234/1331050937_16116718_v1.jpg",
    "price": 6900,
    "provider_id": 4,
    "url": "https://www.airmiles.ca/arrow/RewardsProductDetails?productId=prod2094554"
  },
  {
    "name": "Fitbit Charge 2TM Heart Rate + Fitness Wristband - Blue - Large",
    "description": "Make every beat count with Fitbit Charge 2TM- the all-new heart rate and fitness wristband. Maximize workouts with PurePulse heart rate, multi-sport modes and Connected GPS. Track all-day activity, exercise and sleep. And make the most of your routine with smartphone notifications, Reminders to Move and guided breathing sessions.",
    "image": "https://www.airmiles.ca/arrow/webresource//Images/details_234x234/1331661032_FB407SBUL-CAN_1.jpg",
    "price": 2600,
    "provider_id": 4,
    "url": "https://www.airmiles.ca/arrow/RewardsProductDetails?productId=prod2584483"
  },
  {
    "name": "Napoleon Azure 50 Electric Fireplace",
    "description": "The Napoleon Azure 50 linear electric fireplace is perfect for those wanting an aesthetically pleasing focal point in their room without the need for venting. The high power LED lights make it one of the brightest electrics and can be used in day light or after dark. The Azure 50 electric fireplace feature three different flame color settings to match or enhance any room in your home, a generous glass front and a clear glass ember bed to complement the crisp, clean design. The convenient wall hanging installation allows a quick and easy transformation of living rooms, bedrooms, kitchens, waiting rooms and offices.",
    "image": "https://www.airmiles.ca/arrow/webresource//Images/details_234x234/1331680502_NEFL50H_1.jpg",
    "price": 8000,
    "provider_id": 4,
    "url": "https://www.airmiles.ca/arrow/RewardsProductDetails?productId=prod2657006"
  },
  {
    "name": "Dansk Kobenstyle 4-Quart Casserole - Chili Red",
    "description": "What do a car and the Kobenstyle Chili Red 4-quart Casserole have in common? They both are finished with three coats of enamel. And this casserole has a sporty red finish. The casserole moves effortlessly from stove to table, where its convertible lid becomes a trivet. Of course, you don't want a car in your kitchen, but you will want this casserole. It's easy to clean, too - no polishing required.",
    "image": "https://www.airmiles.ca/arrow/webresource//Images/details_234x234/1331563112_834301.jpg",
    "price": 1500,
    "provider_id": 4,
    "url": "https://www.airmiles.ca/arrow/RewardsProductDetails?productId=prod2584792&cm_sp=Rewards+Product-_-Thumbnails-Products-_-prod2584792"
  },
  {
    "name": "Mark McEwan 11'' Hard Anodized Wok",
    "description": "Renowned chef Mark McEwan partners with GreenPan; the leading healthy ceramic non-stick cookware brand to develop a line of professional quality cookware that is perfect for your home. The patented Thermolon' coating provides great non-stick performance and is easy to clean. Hard anodized aluminum has incredible heat retention and has optimal heat distribution to promote even cooking. High thermal conductivity of the coating allows you to cook on low to medium temperatures making it easier to control. Unlike traditional non-stick coatings, if accidentally overheated these pans will not release any toxic fumes, blister or peel.",
    "image": "https://www.airmiles.ca/arrow/webresource//Images/details_234x234/1331521143_GPMM28WOKHA.jpg",
    "price": 850,
    "provider_id": 4,
    "url": "https://www.airmiles.ca/arrow/RewardsProductDetails?productId=prod2574747"
  },
  {
    "name": "$5 reward",
    "description": "",
    "image": "https://static.indigoimages.ca/Loyalty/plum_card_shadow_EN.png",
    "price": 2500,
    "provider_id": 5,
    "url": "https://www.chapters.indigo.ca/rewards-centre/en-ca/plum-rewards.html"
  },
  {
    "name": "$10 reward",
    "description": "",
    "image": "https://static.indigoimages.ca/Loyalty/plum_card_shadow_EN.png",
    "price": 4500,
    "provider_id": 5,
    "url": "https://www.chapters.indigo.ca/rewards-centre/en-ca/plum-rewards.html"
  },
  {
    "name": "$20 reward",
    "description": "",
    "image": "https://static.indigoimages.ca/Loyalty/plum_card_shadow_EN.png",
    "price": 8500,
    "provider_id": 5,
    "url": "https://www.chapters.indigo.ca/rewards-centre/en-ca/plum-rewards.html"
  },
  {
    "name": "$50 reward",
    "description": "",
    "image": "https://static.indigoimages.ca/Loyalty/plum_card_shadow_EN.png",
    "price": 20000,
    "provider_id": 5,
    "url": "https://www.chapters.indigo.ca/rewards-centre/en-ca/plum-rewards.html"
  },
  {
    "name": "$100 reward",
    "description": "",
    "image": "https://static.indigoimages.ca/Loyalty/plum_card_shadow_EN.png",
    "price": 35000,
    "provider_id": 5,
    "url": "https://www.chapters.indigo.ca/rewards-centre/en-ca/plum-rewards.html"
  },
  {
    "name": "CANADIAN TIRE ‘MONEY’",
    "description": "Collect and redeem your e-Canadian Tire 'Money' right at the checkout in-store on virtually everything at Canadian Tire stores. Simply provide your Canadian Tire Mobile App or My Canadian Tire 'Money' card/key fob, or pay with a Canadian Tire Options MasterCard. You can also donate your e-Canadian Tire 'Money' to Jumpstart, Canadian Tire's national charity. Please see the Program Terms & Conditions for more information. e-Canadian Tire 'Money' cannot be redeemed for alcohol, tobacco, items that we designate on the Program Website and those items which the law does not permit to be purchased this way, or used to make a payment on any Canadian Tire Bank issued credit cards or on loans or for financial or insurance products.",
    "image": "https://www.canadiantire.ca/content/dam/canadian-tire/images/loyalty/loyalty_card.png",
    "price": 1,
    "provider_id": 7,
    "url": "http://www.canadiantire.ca/en/my-canadian-tire-money.html?gclid=EAIaIQobChMI25O1gfDG2AIVwo2zCh1bKgnuEAAYASAAEgL7afD_BwE&gclsrc=aw.ds&dclid=CM654YLwxtgCFcndwAodDXwIEw"
  },
  {
    "name": "PC Plus",
    "description": "You can redeem your points for just about everything available at participating stores, excluding tobacco, alcohol, lottery tickets, or any products or services prohibited by law or as we determine from time to time. Currently, PC Plus™ members are unable to redeem their points for President’s Choice® gift cards, Joe Fresh® gift cards and government taxes. In certain provinces, you will also be prohibited from redeeming your points on prescription medication, over-the-counter medication and milk. Third party retailers, including The Mobile Shop, the cleaners and Wine Shop, are also excluded from the program. Please see our Terms of Use for more details.",
    "image": "http://www.loblaw.ca/content/dam/lclcorp/Images/Info%20Boxes/Loyalty/LOYALTYpcplus.jpg",
    "price": 1,
    "provider_id": 8,
    "url": "https://www.pcplus.ca/loyaltyHome.jsp"
  },
  {
    "name": "AJ Sports Mitch Marner Toronto Maple Leafs Autographed Reebok Premier Hockey Jersey",
    "description": "This hand-signed Mitch Marner Toronto Maple Leafs hockey jersey is an excellent addition to any sports memorabilia collection or the perfect gift for any hockey fan. A dynamic offensive forward, Marner was drafted 4th overall by Toronto in 2015. Marner dominated the OHL and won three MVP awards during the 2015-2016 seasons. Hand signed by Mitch Marner with permanent marker. Name bar, lettering and all numbers are professionally hand sewn on the jersey. Mint condition with original factory tags. \\nIncludes a Certificate of Authenticity & matching exclusive Mitch Marner holograms. \\nColour: Blue/White. \\n60 Day Limited Warranty. \\nModel: MARM10400B.",
    "image": "https://assets.tdrewards.com/img/product/orig.marm10400b.jpg",
    "price": 181214,
    "provider_id": 3,
    "url": "https://www.tdrewards.com/shop/product/1796"
  },
  {
    "name": "Frigidaire Professional 30in. Freestanding Convection Electric Range - Stainless Steel",
    "description": "You have the power to create the most evenly and thoroughly cooked dishes with this Frigidaire Professional 30-inch convection, electric range. \\nCook dishes evenly and get a TV-worthy meal every time with PowerPlus convection. \\nComplementing this feature, the PowerPlus temperature probe lets you set and monitor dish temperature until your meal is cooked just right. \\nYou'll also appreciate the PowerPlus preheat feature that gets your oven ready in just a few minutes for a powerful start to every meal. \\nSpacePro Bridge Element lets you work with one large surface so you can get even heat through a griddle. \\nSmudge-Proof stainless steel resists fingerprints and cleans easily. \\nDimensions: Width: 29.88in. Height: 47.75in. Depth: 28.5in. \\n1 Year Limited Warranty. \\nModel: CPEF3077QF.",
    "image": "https://assets.tdrewards.com/img/product/orig.cpef3077qf.jpg",
    "price": 667129,
    "provider_id": 3,
    "url": "https://www.tdrewards.com/shop/product/3060"
  },
  {
    "name": "American Tourister Darth Vader Large Expandable Spinner Luggage - 31 inch",
    "description": "Fun luggage from the 'Dark Side'! \\n100% tough polycarbonate construction. \\nSingle spinner wheels for a smoother roll. \\nStar Wars branded push button pull handle. Star Wars branded zipper pulls. \\nSplit construction and bold graphics on both sides. \\nLarge mesh pocket on interior of case for packing organization. Cross straps to keep contents secure while traveling. \\n1 Year Limited Warranty. \\nDimensions: 30.5x21x12 in. \\nModel: 65778-4572",
    "image": "https://assets.tdrewards.com/img/product/orig.65778_4572.jpg",
    "price": 76097,
    "provider_id": 3,
    "url": "https://www.tdrewards.com/shop/product/2200"
  },
  {
    "name": "All-Clad 6.5Qt Electric Slow Cooker",
    "description": "The All-Clad Electric Slow Cooker is quite simply the finest of its kind, featuring a generous 6.5-quart capacity, elegant stainless steel exterior and handles convenient glass lid and the longest cooking time available on any slow cooker. \\n \\nThe All-Clad Electric Slow Cooker also features a convenient 3-setting programmable timer. All-Clad's unique combination of advanced technology and timeless style proves that patience is indeed rewarded.",
    "image": "https://assets.tdrewards.com/img/product/orig.sd700450.jpg",
    "price": 97437,
    "provider_id": 3,
    "url": "https://www.tdrewards.com/shop/product/565"
  },
  {
    "name": "!nspire Bellagio queen platform bed with nail-head detail-grey",
    "description": "This Bellagio queen platform bed is fashionable and cozy. The textured fabric of the headboard is trimmed with antique-finished nail head detailing. Elegant crown-shaped headboard. Nail head detailing on headboard. Easy-to-assemble 12-slat kit creates a secure platform with no box spring required.. Solid wood legs in a coffee finish. Mix and match with a variety of case goods. 3 Box Shipment : Box 1: 67 x 49 x 4, 45 lb : Box 2: 66 x 11 x 6, 34 lb : Box 3: 81 x 11 x 7, 53 lb. Minimal Assembly required.1 Year Manufacturer’s Limited Warranty.Model:101-953Q",
    "image": "https://assets.tdrewards.com/img/product/orig.101_953q_gy.jpg",
    "price": 248738,
    "provider_id": 3,
    "url": "https://www.tdrewards.com/shop/product/1082"
  },
  {
    "name": "Azzaro Chrome",
    "description": "Launched in 1996, AZZARO CHROME is an intoxicatingly masculine fragrance with bergamot, lavender, and ginger. Enriched with cardamom, sandalwood, rosewood, ivy, oakwood, and neroli this cologne is sure to tantalize the senses. Size: 100ml",
    "image": "https://assets.tdrewards.com/img/product/orig.m275_100t.jpg",
    "price": 27809,
    "provider_id": 3,
    "url": "https://www.tdrewards.com/shop/product/72"
  },
  {
    "name": "Arozzi Verona Pro Gaming Chair - Red",
    "description": "Meet Verona Pro. Where Arozzi refines the experience of the superior Verona gaming chair. Our Swedish designers have integrated the most popular features from our other product lines along with the latest in ergonomic design to produce a chair that puts you at the center of control and comfort. Supple pleather covering over a lightweight metal frame gives a luxury feel while maintaining the flexibility to move and react quickly. \\nThe Verona Pro has all the great ergonomic features of Verona–extra padded seating, adjustable armrests, extra and adjustable back and head support—plus an advanced and reinforced seat mechanism with preset and lockable tilt positons. Verona Pro also adds distinctive three-color combinations for a unique visual appeal. When it’s time to win the Verona Pro will get you across the line with comfort, strength and style to spare.",
    "image": "https://assets.tdrewards.com/img/product/orig.177612.jpg",
    "price": 187258,
    "provider_id": 3,
    "url": "https://www.tdrewards.com/shop/product/1153"
  },
  {
    "name": "Alpina Startimer Pilot Automatic Chronograph Watch",
    "description": "Stainless steel 44mm case with an AL-725 automatic chronograph movement, water resistant up to 100m, scratch-resistant sapphire crystal with anti- reflective treatment, black dial with engraved case back, and screw-down crown. Black leather strap with steel buckle. \\nFunctions: Hours, minutes, chronograph, date. \\nCase material: Stainless steel, brushed. \\nBezel material: Stainless steel, polished. \\n2 Year Limited Warranty. \\nModel: AL-725B4S6.",
    "image": "https://assets.tdrewards.com/img/product/orig.al_725b4s6.jpg",
    "price": 721585,
    "provider_id": 3,
    "url": "https://www.tdrewards.com/shop/product/2397"
  },
  {
    "name": "Baskits Gq",
    "description": "Ideal for men of any facial hair status! Our GQ Baskit features the best of the best shaving products from CRUX Supply Company pre-shave oil, post-shave tonic, charcoal grit bar, Rebel Refinery's organic bar soap, to Dot & Lil's shaving soap: all neatly displayed in a keepsake modern base. \\nModel: M10416",
    "image": "https://assets.tdrewards.com/img/product/orig.m10416.jpg",
    "price": 61633,
    "provider_id": 3,
    "url": "https://www.tdrewards.com/shop/product/1582"
  },
  {
    "name": "Crayola Shopkins Creativity Case",
    "description": "The Crayola Shopkins Create & Carry Case is a 2-in-1 art storage case and lap desk that contains a variety of cool Crayola art tools & fun Shopkins colouring pages! \\nWith its compact design, the Shopkins Create & Carry Case makes an ideal traveling companion. Kids can slip it into a backpack for fun at school or take it with them during long car rides for entertainment on the road. \\nThe case doubles as a handy lap desk with a large drawing surface and convenient holders for tools in use. \\nIncludes 10 Ultra Clean Broad Line Markers, 1 Stamper Marker, 16 Crayons, 12 Short Coloured Pencils & 20 Shopkins themed Colouring Pages. \\nModel: 04-1642.",
    "image": "https://assets.tdrewards.com/img/product/orig.04_1642.jpg",
    "price": 12327,
    "provider_id": 3,
    "url": "https://www.tdrewards.com/shop/product/2718"
  },
  {
    "name": "Apple 12 Months Apple Music Card",
    "description": "Get all the music you want with an Apple Music subscription. Listen to millions of songs, curated radio and playlists, recommendations for you, exclusives, and more. Choose from a 3 or 12-month membership.",
    "image": "https://assets.tdrewards.com/img/product/orig.am_12m.jpg",
    "price": 39600,
    "provider_id": 3,
    "url": "https://www.tdrewards.com/shop/product/2054"
  },
  {
    "name": "Adesso CyberTablet T22HD - Adesso 21.5 inch Tablet Monitor",
    "description": "The CyberTablet T22HD Tablet Monitor features high definition, high resolution and brings you a brand new visual experience in HD quality. It integrates an HD screen of 1980 x 1080 pixels with built in pen pressure technology of 2048 levels of pressure sensitivity. Simply connect the CyberTablet T22HD to your computer or notebook, and use the digital stylus pen to make drawing as smooth and easy as it would be if you were using a pencil and paper. The tablet's stylus pen also acts as a mouse for easy navigation while you create or edit photos. \\nOperating System: Windows 2000, XP, Vista, 7, 8, 10, Mac OSX 10.6 & above. \\nColour: Black. \\nDimensions: 21x12.75x1.25 in (without stand). \\nModel: 5699234.",
    "image": "https://assets.tdrewards.com/img/product/orig.5699234.jpg",
    "price": 395838,
    "provider_id": 3,
    "url": "https://www.tdrewards.com/shop/product/1907"
  },
  {
    "name": "Aluratek ergonomic laptop cooling table with fan - silver",
    "description": "Adjustable Laptop Cooling Table with Fan is a great solution to cool your laptop while providing a comfortable customizable working surface. We all know that excessive heat harms the performance of any electronic device. Extend the life and functionality of your laptop by providing a constant even flow of cool air to keep your system from overheating. \\nThe cooling table supports MacBook Pro, MacBook Air, Chromebook, Ultrabook, netbooks and all laptops up to 17 inches as well as tablets and smartphones. Connect the cooling table to your laptop with the attached USB cable. The Adjustable Cooling Table is USB bus powered with low power consumption so no need for an external power adapter. \\nColour: Silver. \\n1 Year Limited Warranty. \\nDimensions open: 20.5 x 12 x 9.5 to 12.5 in. \\nModel: ACT01F.",
    "image": "https://assets.tdrewards.com/img/product/orig.act01f.jpg",
    "price": 31476,
    "provider_id": 3,
    "url": "https://www.tdrewards.com/shop/product/1910"
  },
  {
    "name": "Guzzie & Guss Hornby Double Stroller - Black",
    "description": "The Hornby stroller has a highly innovative design with trendy single front lockable wheels, and a new no-pinch frame fold mechanism, Each seat is independent of the other, so you can have one seat reclined while the other is upright, Canopy and footrest are all-enclosing to help keep your baby shaded from the sun, and safe and secure, We have taken what parents have told us, and made a side by side stroller that will fit through most doorways: the Hornby stroller is less than 76cm (30 inches) at the widest spot, Child Age: 3 months up to 45lbs per seat",
    "image": "https://assets.tdrewards.com/img/product/orig.g_g125_black.jpg",
    "price": 146540,
    "provider_id": 3,
    "url": "https://www.tdrewards.com/shop/product/558"
  },
  {
    "name": "Bowsers Luxury Back Seat Cover - Herringbone",
    "description": "Bowsers Luxury Back Seat Cover - Protect your car seats from spills and pet hair! Proudly made in Canada, Tufted bottom cushion and contrast binding add a touch of class to any vehicle, Plush Microvelvet fabrics repel pet hair and moisture, Bottom cushion filled with High Density fiber, Elastic strap ensures secure fit, Measures 57 inch l x 19 inch w x 2 inch h",
    "image": "https://assets.tdrewards.com/img/product/orig.11364.jpg",
    "price": 54361,
    "provider_id": 3,
    "url": "https://www.tdrewards.com/shop/product/593"
  }
]